package 과제_Level.Level4;

public class Level4_1 {

/*
1. 객체란?
    클래스에서 멤버변수와 메소드를 사용할수 있는 하나의 유닛
    자동차같이 처음부터 옵션을 탑재 생산한 경우 -> 생성자 매개변수를 통한 변수 저장
    나중에 옵션을 추가할 경우 -> 객체의 해당 변수가 대입/ private 변수일 경우 setter/getter 로 대입


2. 클래스란?
    객체를 생성해네는 공장 하나의 클래스 내에서 수많은 객체를 생성해낼수 있다
    같은 옵션이라도 동일한 객체가 아닌 각각의 객체이다.


3. 멤버변수/필드/속성/특성이란?
    다 같은말이지만 여러개로 부름
    클래스내에 선언되어 있는 특성들
    객체를 생성할때 매개변수에 맞게 입력하면 처음부터 그 객체는 특성을 가지고 생성됨


4. 지역변수와 멤버변수 차이점
    멤버변수는 객체가 가지고 있는 고유한 특성이라면
    지역변수는 함수내에 생성되어 그 함수내에서만 활용할수 있다.
    다른 함수에서도 그 지역변수를 사용하고 싶으면 한번더 선언해주거나 전역변수로 선언해주면 된다.

*/




}
